first_routes/app/controllers/artwork_shares_controller.rb

  def create
    share = ArtworkShare.new(artwork_share_params)

    if share.save
---
INSERT INTO "artwork_shares" ("artwork_id", "viewer_id") VALUES ($1, $2) RETURNING "id"  [["artwork_id", 15], ["viewer_id", 9]]