first_routes/app/controllers/artworks_controller.rb

  def index
    @owned = Artwork.where(artist_id: params[:user_id])
    @shared = User.find(params[:user_id]).shared_artworks
---
SELECT "artworks".* FROM "artworks" WHERE "artworks"."artist_id" = $1  [["artist_id", 8]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]

  def update
    artwork = Artwork.find(params[:id])

    if artwork.update(artwork_params)
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
UPDATE "artworks" SET "title" = $1 WHERE "artworks"."id" = $2  [["title", "ok art"], ["id", 10]]